tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "romkatv/powerlevel10k"
brew "python@3.10"
brew "azure-cli"
brew "python@3.9"
brew "gh", args: ["HEAD"]
brew "git"
brew "gnupg"
brew "go"

# Powerline and its required fonts
cask "font-meslo-lg-nerd-font"
brew "powerlevel10k"

brew "rbenv"
brew "ruby-build"
brew "libyaml" # rbenv dependency
brew "gmp" # rbenv dependency
brew "terraform-docs"
brew "tfenv"
brew "wget"
brew "ykman"
brew "jq"
brew "stow"

cask "visual-studio-code"

# Some things to make macOS a little better
cask "sensiblesidebuttons" # Adds Windows-like back/forward buttons to mice
cask "rectangle" # Window manager, for shortcuts arranging windows
